# drinks_data.py

JUICES = [
    "سیب", "انار", "آلبالو", "پرتقال", "آناناس", "انگور سفید", "انگور سیاه"
]

NECTARS = [
    "انبه", "پرتقال پالپ دار", "هلو", "هفت میوه"
]

MIXED_JUICES = [
    "انار آلبالو", "آلبالو زرشک", "مرکبات", "آناناس استارفروت",
    "کرنبری پریپ فروت", "کیوی و لیمو", "گوجه فرنگی فلفل"
]

SYRUPS = [
    "توت فرنگی", "پشن فروت", "بلوبری", "بلک بری", "انگور",
    "گواوا", "موز", "بلوکارسائو", "گرین میکس", "گرانادین", "خیار", "گواوا"
]

HERBAL_SYRUPS = [
    "هل", "فلفل", "بادیان", "ماسالا"
]

FRUITS_AND_HERBS = [
    "ریحان", "لیمو زرد", "گل خوراکی", "رزماری", "نعنا تازه",
    "توت فرنگی", "پرتقال"
]

# همه مواد یکجا برای جستجو راحت‌تر
ALL_INGREDIENTS = JUICES + NECTARS + MIXED_JUICES + SYRUPS + HERBAL_SYRUPS + FRUITS_AND_HERBS
