import random

# لیست مواد مصرفی و مقادیر آن‌ها که به عنوان ورودی برای ساخت رسیپی استفاده می‌شود
ingredients = {
    'آب سیب': 50,
    'آب انار': 50,
    'آب آلبالو': 50,
    'آب پرتقال': 50,
    'آب آناناس': 50,
    'آب انگور سفید': 50,
    'آب انگور سیاه': 50,
    'نکتار انبه': 50,
    'نکتار پرتقال پالپ دار': 50,
    'نکتار هلو': 50,
    'نکتار هفت میوه': 50,
    'سیروپ توت فرنگی': 15,
    'سیروپ پشن فروت': 15,
    'سیروپ بلوبری': 15,
    'سیروپ بلک بری': 15,
    'سیروپ انگور': 15,
    'سیروپ گواوا': 15,
    'سیروپ موز': 15,
    'سیروپ بلوکارسائو': 15,
    'سیروپ گرین میکس': 15,
    'سیروپ گرانادین': 15,
    'سیروپ خیار': 15,
    'سیروپ گواوا': 15,
    'سیروپ هل': 5,
    'سیروپ فلفل': 5,
    'سیروپ بادیان': 5,
    'سیروپ ماسالا': 5,
    'ریحان': 5,
    'لیمو زرد': 10,
    'گل خوراکی': 5,
    'رزماری': 5,
    'نعنا تازه': 5,
    'توت فرنگی': 10,
    'پرتقال': 10
}

def generate_recipe() -> dict:
    """ تابعی برای تولید یک رسیپی تصادفی از مواد موجود
    
    این تابع از مواد موجود و مقادیر آن‌ها برای تولید یک رسیپی نوشیدنی تصادفی استفاده می‌کند.
    """
    # انتخاب مواد به صورت تصادفی
    num_ingredients = random.randint(4, 6)  # تعداد مواد را بین 4 تا 6 انتخاب می‌کند
    selected_ingredients = random.sample(list(ingredients.items()), num_ingredients)

    recipe = {}
    for ingredient, quantity in selected_ingredients:
        recipe[ingredient] = f"{quantity} میلی لیتر"

    # اضافه کردن دستورالعمل‌ها
    recipe['دستورالعمل'] = "لیوان را سرد کرده و سپس مواد را داخل لیوان اضافه کرده و به خوبی هم بزنید."

    return recipe

